nxp-appcodehub/an-mcxn236-usb-bridge-to-i3c/source/virtual_com.c
    usb_i3c_param_t param;
    usb_i3c_state_t i3c_state = KUSB_I3C_NoneProcess;
    i3c_master_handle_t *s_i3c_m_handle;

    for (uint8_t i = 1; i < USB_DEVICE_CONFIG_CDC_ACM; i++)
    {
    	s_i3c_m_handle = (i == 0x0) ? &g_i3c0_m_handle : &g_i3c1_m_handle;
    	vcomInstance = &g_deviceComposite->cdcVcom[i];

    	if ((1 == vcomInstance->attach) && (1 == vcomInstance->startTransactions))
        {
            /* Enter critical can not be added here because of the loop */
            /* endpoint callback length is USB_CANCELLED_TRANSFER_LENGTH (0xFFFFFFFFU) when transfer is canceled */
            if ((0 != vcomInstance->recvSize) && (USB_CANCELLED_TRANSFER_LENGTH != vcomInstance->recvSize))
            {
            	s_frameNum++;

            	if(s_frameNum == 0x1)
            	{
            	    /* Start counting */
            		CTIMER_StartTimer(CTIMER0);
            	}

    			RingBuf_Write(&usb_ringBuffer, vcomInstance->currRecvBuf, vcomInstance->recvSize);
    			vcomInstance->recvSize = 0;
                error = USB_DeviceCdcAcmSend(vcomInstance->cdcAcmHandle, vcomInstance->bulkInEndpoint, NULL, 0);
            }
            if(CTIMER0->TC == matchConfig.matchValue)
            {
            	CTIMER_StopTimer(CTIMER0);
            	CTIMER_Reset(CTIMER0);
            	vcomInstance->totalrecvSize = RingBuf_GetUsedBytes(&usb_ringBuffer);
            	RingBuf_Read(&usb_ringBuffer, vcomInstance->totalRecvBuf, 0x1000);
            	s_frameNum = 0;
            	i3c_transfer_start = true;
            }

    		/* User Code */
            /* endpoint callback length is USB_CANCELLED_TRANSFER_LENGTH (0xFFFFFFFFU) when transfer is canceled */
            if (i3c_transfer_start)
            {
            	i3c_transfer_start = false;

            	/*write without register address 'WN(0x57 0x44) slaveAddress() len() data()'*/
            	if((vcomInstance->totalRecvBuf[0] == 0x57) && (vcomInstance->totalRecvBuf[1] == 0x44))
            	{
            		memset(&param, 0, sizeof(param));
            		i3c_state = KUSB_I3C_DataWrite;
            		param.i3c_mode = vcomInstance->totalRecvBuf[2];
            		param.slaveAddress = vcomInstance->totalRecvBuf[3];
            		param.len = ((vcomInstance->totalRecvBuf[4] << 0x8) | vcomInstance->totalRecvBuf[5]);
            		usb_i3c_send_recv_buf((vcomInstance->totalRecvBuf + 6), i3c_state, param.len);
					if(param.len)
            		{
						usb_i3c_data_write(i, param, s_i3c_m_handle);
					}
					else
					{
						send_size = 0;
					}
            	}
				/*Write with register address 'WA(0x57 0x41) slaveAddress() regAddress() len() data()'*/
            	else if((vcomInstance->totalRecvBuf[0] == 0x57) && (vcomInstance->totalRecvBuf[1] == 0x41))
            	{
            		memset(&param, 0, sizeof(param));
            		i3c_state = KUSB_I3C_RegDataWrite;
            		param.i3c_mode = vcomInstance->totalRecvBuf[2];
            		param.slaveAddress = vcomInstance->totalRecvBuf[3];
            		param.regAddress = vcomInstance->totalRecvBuf[4];
            		param.len = ((vcomInstance->totalRecvBuf[5] << 0x8) | vcomInstance->totalRecvBuf[6]);
            		usb_i3c_send_recv_buf((vcomInstance->totalRecvBuf + 7), i3c_state, param.len);
            		//if(param.len)
					{
            			usb_i3c_reg_data_write(i, param, s_i3c_m_handle);
					}
					//else
					{
						//send_size = 0;
					}
            	}
            	/*Read without register address 'RN(0x52 0x44) slaveAddress() len()*/
            	else if((vcomInstance->totalRecvBuf[0] == 0x52) && (vcomInstance->totalRecvBuf[1] == 0x44))
            	{
            		memset(&param, 0, sizeof(param));
            		i3c_state = KUSB_I3C_DataRead;
            		param.i3c_mode = vcomInstance->totalRecvBuf[2];
            		param.slaveAddress = vcomInstance->totalRecvBuf[3];
            		param.len = ((vcomInstance->totalRecvBuf[4] << 0x8) | vcomInstance->totalRecvBuf[5]);
            		if(param.len)
            		{
                		usb_i3c_data_read(i, param, s_i3c_m_handle);
            		}
            		else
            		{
            			send_size = 0;
            		}
            	}
            	/*Read with register address 'RA(0x52 0x41) slaveAddress() regAddress() len()*/
            	else if((vcomInstance->totalRecvBuf[0] == 0x52) && (vcomInstance->totalRecvBuf[1] == 0x41))
            	{
            		memset(&param, 0, sizeof(param));
            		i3c_state = KUSB_I3C_RegDataRead;
            		param.i3c_mode = vcomInstance->totalRecvBuf[2];
            		param.slaveAddress = vcomInstance->totalRecvBuf[3];
            		param.regAddress = vcomInstance->totalRecvBuf[4];
            		param.len = ((vcomInstance->totalRecvBuf[5] >> 0x8) | vcomInstance->totalRecvBuf[6]);
            		//if(param.len)
					{
            			usb_i3c_reg_data_read(i, param, s_i3c_m_handle);
					}
					//else
					{
						//send_size = 0;
					}
            	}
            	/*List DAA 'LDAA(0x4C 0x44 0x41 0x41) addressNum() vendorID(u16) dynamicAddress()'*/
            	else if((vcomInstance->totalRecvBuf[0] == 0x4C) && (vcomInstance->totalRecvBuf[1] == 0x44)
            		 && (vcomInstance->totalRecvBuf[2] == 0x41) && (vcomInstance->totalRecvBuf[3] == 0x41))
            	{
            		memset(&param, 0, sizeof(param));
            		i3c_state = KUSB_I3C_DAAList;
            		param.ccc_code = KUSB_I3C_RSTDAA;
            		param.daa_para.address_num = vcomInstance->totalRecvBuf[4];
            		usb_i3c_send_recv_buf((vcomInstance->totalRecvBuf + 5), i3c_state, param.daa_para.address_num);
            		usb_i3c_ccc_write_broadcast(i, param, s_i3c_m_handle);
            	}
            	/*CCC broadcast command send 'CCC(0x43 0x43 0x43 0x42) command(), len, data'*/
            	else if((vcomInstance->totalRecvBuf[0] == 0x43) && (vcomInstance->totalRecvBuf[1] == 0x43)
            		 && (vcomInstance->totalRecvBuf[2] == 0x43) && (vcomInstance->totalRecvBuf[3] == 0x42))//CCC command
            	{
            		memset(&param, 0, sizeof(param));
            		i3c_state = KUSB_I3C_CCCBroadcastSend;
					param.ibi_type = kI3C_IbiRespAckMandatory;
            		param.ccc_code = vcomInstance->totalRecvBuf[4];
            		param.len = vcomInstance->totalRecvBuf[5];
            		usb_i3c_send_recv_buf((vcomInstance->totalRecvBuf + 6), i3c_state, param.len);
            		usb_i3c_ccc_write_broadcast(i, param, s_i3c_m_handle);
            	}
            	/*CCC direct command send 'CCC(0x43 0x43 0x43 0x44) salve, command(), len, data'*/
            	else if((vcomInstance->totalRecvBuf[0] == 0x43) && (vcomInstance->totalRecvBuf[1] == 0x43)
            		 && (vcomInstance->totalRecvBuf[2] == 0x43) && (vcomInstance->totalRecvBuf[3] == 0x44))//CCC command
            	{
            		memset(&param, 0, sizeof(param));
            		i3c_state = KUSB_I3C_CCCDirectSend;
            		param.slaveAddress = vcomInstance->totalRecvBuf[4];
            		param.ccc_code = vcomInstance->totalRecvBuf[5];
            		param.len = vcomInstance->totalRecvBuf[6];
            		usb_i3c_send_recv_buf((vcomInstance->totalRecvBuf + 7), i3c_state, param.len);
            		usb_i3c_ccc_write_direct(i, param, s_i3c_m_handle);
            	}

