nxp-appcodehub/an-mcxn236-usb-bridge-to-i3c/source/virtual_com.c
            	if(i3c_state == KUSB_I3C_DAAList)
            	{
            		/*Wait RSTDAA transfer completion and get deviceList to send*/
            		if(usb_i3c_get_transfer_status(&transfer_status))
            		{
            			usb_i3c_clear_status();
            			if(transfer_status == kStatus_Success)
            			{
            				usb_i3c_list_DAA(i, param, s_i3c_m_handle);
                    		usb_i3c_get_send_buf(vcomInstance->currSendBuf, i3c_state, param, &send_size);
            			}
            			else
            			{
                			send_size = 0;
            			}
            		}
            		else
            		{
            			send_size = 0;
            		}
            	}
            	else
            	{
            		/*Wait transfer completion and get rx_data or tx_data to send*/
            		for(uint32_t time_index = 0; time_index < 3000; time_index++);

            		if(usb_i3c_get_transfer_status(&transfer_status))
            		{
            			usb_i3c_clear_status();
            			if(transfer_status == kStatus_Success)
            			{
                    		usb_i3c_get_send_buf(vcomInstance->currSendBuf, i3c_state, param, &send_size);
            			}
            			else
            			{
                			send_size = 0;
            			}
            		}
            		else
            		{
            			send_size = 0;
            		}
            	}
               	memset(vcomInstance->totalRecvBuf, 0, vcomInstance->totalrecvSize);
    			vcomInstance->recvSize = 0;
    			send_flag = true;
            }

            /* Check IBI type (Normal IBI/Hot-join)*/
            state = usb_i3c_slave_request_check(i, vcomInstance->currSendBuf, &send_size);

            /* check slave IBI and get IBI data */
            if(state == KUSB_I3C_IBI_Check)
            {
            	send_flag = true;
            }
            else if(state == KUSB_I3C_DAAList)
            {
            	//used for hot-join DAA process
    			memset(&param, 0, sizeof(param));
				i3c_state = KUSB_I3C_DAAList;
				param.ccc_code = KUSB_I3C_RSTDAA;
				param.daa_para.address_num = g_daaListAuto[0];
				param.daa_para.vendor_id = (g_daaListAuto[1] | (g_daaListAuto[2] << 8));
				usb_i3c_send_recv_buf(&g_daaListAuto[3], i3c_state, param.daa_para.address_num);
				usb_i3c_ccc_write_broadcast(i, param, s_i3c_m_handle);
				auto_dda_flag = true;
				send_flag = true;
            }

            if(auto_dda_flag)
            {
        		if(usb_i3c_get_transfer_status(&transfer_status))
        		{
        			usb_i3c_clear_status();
        			if(transfer_status == kStatus_Success)
        			{
        				usb_i3c_list_DAA(i, param, s_i3c_m_handle);
                		usb_i3c_get_send_buf(vcomInstance->currSendBuf, i3c_state, param, &send_size);
                		auto_dda_flag = false;
        			}
        			else
        			{
            			send_size = 0;
        			}
        		}
        		else
        		{
        			send_size = 0;
        		}
            }

            if(send_flag)
            {
            	send_flag = false;

            	error = USB_DeviceCdcAcmSend(vcomInstance->cdcAcmHandle, vcomInstance->bulkInEndpoint,
                                             vcomInstance->currSendBuf, send_size);

                if (error != kStatus_USB_Success)
                {
                    /* Failure to send Data Handling code here */
                }
            }
        }
    }
}

/*!
 * @brief Virtual COM device set configuration function.
 *
 * This function sets configuration for CDC class.
 *
 * @param handle The CDC ACM class handle.
 * @param configure The CDC ACM class configure index.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceCdcVcomSetConfigure(class_handle_t handle, uint8_t configure)
{
    if (USB_COMPOSITE_CONFIGURE_INDEX == configure)
    {
        /*endpoint information for cdc 1*/
        g_deviceComposite->cdcVcom[0].attach = 1;

        g_deviceComposite->cdcVcom[0].interruptEndpoint              = USB_CDC_VCOM_CIC_INTERRUPT_IN_ENDPOINT;
        g_deviceComposite->cdcVcom[0].interruptEndpointMaxPacketSize = g_cdcVcomCicEndpoints[0].maxPacketSize;

        g_deviceComposite->cdcVcom[0].bulkInEndpoint              = USB_CDC_VCOM_DIC_BULK_IN_ENDPOINT;
        g_deviceComposite->cdcVcom[0].bulkInEndpointMaxPacketSize = g_cdcVcomDicEndpoints[0].maxPacketSize;

        g_deviceComposite->cdcVcom[0].bulkOutEndpoint              = USB_CDC_VCOM_DIC_BULK_OUT_ENDPOINT;
        g_deviceComposite->cdcVcom[0].bulkOutEndpointMaxPacketSize = g_cdcVcomDicEndpoints[1].maxPacketSize;

        /* Schedule buffer for receive */
        USB_DeviceCdcAcmRecv(g_deviceComposite->cdcVcom[0].cdcAcmHandle, g_deviceComposite->cdcVcom[0].bulkOutEndpoint,
                             s_currRecvBuf[0], g_deviceComposite->cdcVcom[0].bulkOutEndpointMaxPacketSize);

        /*endpoint information for cdc 2*/
        g_deviceComposite->cdcVcom[1].attach = 1;

        g_deviceComposite->cdcVcom[1].interruptEndpoint              = USB_CDC_VCOM_CIC_INTERRUPT_IN_ENDPOINT_2;
        g_deviceComposite->cdcVcom[1].interruptEndpointMaxPacketSize = g_cdcVcomCicEndpoints_2[0].maxPacketSize;

        g_deviceComposite->cdcVcom[1].bulkInEndpoint              = USB_CDC_VCOM_DIC_BULK_IN_ENDPOINT_2;
        g_deviceComposite->cdcVcom[1].bulkInEndpointMaxPacketSize = g_cdcVcomDicEndpoints_2[0].maxPacketSize;

        g_deviceComposite->cdcVcom[1].bulkOutEndpoint              = USB_CDC_VCOM_DIC_BULK_OUT_ENDPOINT_2;
        g_deviceComposite->cdcVcom[1].bulkOutEndpointMaxPacketSize = g_cdcVcomDicEndpoints_2[1].maxPacketSize;

        /* Schedule buffer for receive */
        USB_DeviceCdcAcmRecv(g_deviceComposite->cdcVcom[1].cdcAcmHandle, g_deviceComposite->cdcVcom[1].bulkOutEndpoint,
                             s_currRecvBuf[1], g_deviceComposite->cdcVcom[1].bulkOutEndpointMaxPacketSize);
    }
    return kStatus_USB_Success;
}

/*!
 * @brief Virtual COM device initialization function.
 *
 * This function initializes the device with the composite device class information.
 *
 * @param deviceComposite The pointer to the composite device structure.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceCdcVcomInit(usb_device_composite_struct_t *deviceComposite)
{
    g_deviceComposite = deviceComposite;
    for (uint8_t i = 0; i < USB_DEVICE_CONFIG_CDC_ACM; i++)
    {
        g_deviceComposite->cdcVcom[i].lineCoding    = (uint8_t *)&s_lineCoding[i];
        g_deviceComposite->cdcVcom[i].abstractState = (uint8_t *)&s_abstractState[i];
        g_deviceComposite->cdcVcom[i].countryCode   = (uint8_t *)&s_countryCode[i];
        g_deviceComposite->cdcVcom[i].usbCdcAcmInfo = &s_usbCdcAcmInfo[i];
        g_deviceComposite->cdcVcom[i].currRecvBuf   = (uint8_t *)&s_currRecvBuf[i][0];
        ;
        g_deviceComposite->cdcVcom[i].currSendBuf  = (uint8_t *)&s_currSendBuf[i][0];
        g_deviceComposite->cdcVcom[i].totalRecvBuf = (uint8_t *)&s_totalRecvBuf[i][0];
    }
    return kStatus_USB_Success;
}
